КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_Сценарии/КонтурЛогистика_Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_Сценарии</name>
  <enumValues>
    <name>Отправка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновика_ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаЧерновика</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаНеОбрабатывать</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаШаблона</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииОтправкиТитулов/КонтурЛогистика_СценарииОтправкиТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииОтправкиТитулов</name>
  <comment>что будет делать действие с задачей по умолчанию по конкретной настройке конвертации документа</comment>
  <enumValues>
    <name>НеПодписыватьОтправитьВФоне</name>
  </enumValues>
  <enumValues>
    <name>НеПодписыватьОтправитьВСеансе</name>
  </enumValues>
  <enumValues>
    <name>ПодписыватьОтправитьВФоне</name>
  </enumValues>
  <enumValues>
    <name>ПодписыватьОтправитьВСеансе</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЧерновик</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьВходящий</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НаправлениеКонвертации/КонтурЛогистика_НаправлениеКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НаправлениеКонвертации</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееВходящее</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыНастроекКонвертаций/КонтурЛогистика_ТипыНастроекКонвертаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыНастроекКонвертаций</name>
  <enumValues>
    <name>Основная</name>
  </enumValues>
  <enumValues>
    <name>Расширенная</name>
  </enumValues>
  <enumValues>
    <name>Замещающая</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВариантыРазделителя/КонтурЛогистика_ВариантыРазделителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВариантыРазделителя</name>
  <enumValues>
    <name>НеРазделять</name>
    <comment>Не применять ввод нескольких документов ТрН из 1 документа основания</comment>
  </enumValues>
  <enumValues>
    <name>РеквизитТабличнойЧастиДокумента</name>
    <comment>В документе основании есть табчасть в котрой есть колонка с разделителем</comment>
  </enumValues>
  <enumValues>
    <name>ВычислитьМассивВыражениемНаЯзыке1С</name>
    <comment>Вычислить переменную РезультатВычисления в которой будет массив разделителей</comment>
  </enumValues>
  <enumValues>
    <name>СвязанныеДокументы</name>
    <comment>В этих документах в реквизите указан ДокументОснование на который настроена конвертация.</comment>
  </enumValues>
  <enumValues>
    <name>ВычислитьУсловиеФильтраНаЯзыке1С</name>
    <comment>применяется для Т3</comment>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ДействияПриОтказеВалидации/КонтурЛогистика_ДействияПриОтказеВалидации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ДействияПриОтказеВалидации</name>
  <comment>Доступные действия при отказе валидации</comment>
  <enumValues>
    <name>ЗапретПодписания</name>
  </enumValues>
  <enumValues>
    <name>ТолькоРучноеПодписание</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
    <comment>Подписание разрешено</comment>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_КонвертацияСерверПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область КонвертацияДокументов

// Типы документов конфигурации для которых есть типовая конвертация
//
// Параметры:
//  ТипДокументаЛогистика	 - ПеречислениеСсылка.КонтурЛогистика_ТипыЛогистическихДокументов	 - Тип докуента Логистики.
//  СпецСценарий			 - ПеречислениеСсылка.КонтурЛогистика_СпецСценарииЗадач				 - Спец. сценарии задач.
// 
// Возвращаемое значение:
//  Массив из Строка - Имена типов документов.
//
Функция ПоддерживаемыеТипыДокументовКонфигурации1С(Знач ТипДокументаЛогистика, Знач СпецСценарий) Экспорт
	
	Возврат КонтурЛогистика_КонвертацияТиповые.ПоддерживаемыеТипыДокументовКонфигурации1С(ТипДокументаЛогистика, СпецСценарий);
	
КонецФункции

// Контекст настройки конвертации документов с учетом типа учетного документа
//
// Параметры:
//  ТипДокументаЛогистика			 - ПеречислениеСсылка.КонтурЛогистика_ТипыЛогистическихДокументов	 - Тип документа Логистики.
//  ПредставлениеУчетногоДокумента	 - Строка, Тип, ДокументСсылка, Неопределено	 - Представление учетного документа.
//																					   Неопределено = любой тип.
//  СпецСценарий					 - ПеречислениеСсылка.КонтурЛогистика_СпецСценарииЗадач				 - Спец. сценарии задач.
// 
// Возвращаемое значение:
//  Структура - См. КонтурЛогистика_КонвертацияСерверПовтИсп.МанифестКонтекстаНастройкиКонвертацииДокументов
//
Функция КонтекстНастройкиКонвертацииУчетногоДокумента(Знач ТипДокументаЛогистика, Знач ПредставлениеУчетногоДокумента = Неопределено, Знач СпецСценарий = Неопределено, Знач ОбратныйМаппинг = Неопределено) Экспорт
	
	// Базовое заполнение
	Контекст = МанифестКонтекстаНастройкиКонвертацииДокументов();
	Контекст.ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	Контекст.ТипДокументаЛогистика = ТипДокументаЛогистика;
	Контекст.ТипДокумента1С = КонтурЛогистика_ОбщегоНазначенияСервер.ПредставлениеУчетногоДокументаСтрокой(
		ПредставлениеУчетногоДокумента);
	Если ПредставлениеУчетногоДокумента = Неопределено Тогда
		Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
		Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
		Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
	КонецЕсли;
	
	// Дополнения
	Контекст.ЭтоКТ2000 = ЭтоКТ2000();
	Контекст.ЕстьРегистрДокументыФизическихЛиц = ЕстьРегистрДокументыФизическихЛиц();
	
	// Заполняем типовой частью
	КонтурЛогистика_КонвертацияТиповые.ЗаполнитьБазовыеНастройкиКонвертации(Контекст);
	
	// Поиск настроек конвертации в справочнике
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		ТипДокументаЛогистика, ПредставлениеУчетногоДокумента, СпецСценарий, ОбратныйМаппинг);
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда
		
		Контекст.ЕстьНастройкаКонвертации = Истина;
		Контекст.НастройкаКонвертации = НастройкаКонвертации;
		
		Если НастройкаКонвертации.Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Основная Тогда
			
			// Для типовой переносим, только часть реквизитов, которые пользователь может изменить интерактивно
			СвойстваТиповойНастройки = СвойстваТиповойНастройкиКонвертацииДокументовДоступныеДляРедактирования();
			Для Каждого ИмяСвойства Из СвойстваТиповойНастройки Цикл
				ТекущееЗначение = НастройкаКонвертации[ИмяСвойства];
				Если ЗначениеЗаполнено(ТекущееЗначение) Тогда
					Контекст[ИмяСвойства] = ТекущееЗначение;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			// Перенесем настройки
			ЗаполнитьЗначенияСвойств(Контекст, НастройкаКонвертации,, "ДополнительныеКолонки, ПроизвольныеВалидации");
			
			Для Каждого Элемент Из Контекст.ПутиРеквизитовУчетногоДокумента Цикл
				Контекст.ПутиРеквизитовУчетногоДокумента.Вставить(Элемент.Ключ, НастройкаКонвертации[Элемент.Ключ]);
			КонецЦикла;
			
		КонецЕсли;
		
		// Дополнительные колонки
		Для Каждого ТекущаяСтрока Из НастройкаКонвертации.ДополнительныеКолонки Цикл
			ОписаниеКолонки = МанифестОписанияДоплнительнойКолонки();
			ЗаполнитьЗначенияСвойств(ОписаниеКолонки, ТекущаяСтрока);
			Контекст.ДополнительныеКолонки.Добавить(ОписаниеКолонки);
		КонецЦикла;
		
		// Проставим порядковый номер
		НомерСтроки = 0;
		Для Каждого ТекущаяСтрока Из Контекст.ДополнительныеКолонки Цикл
			НомерСтроки = НомерСтроки + 1;
			ТекущаяСтрока.НомерСтроки = НомерСтроки;
		КонецЦикла;
		
		// Валидация
		Для Каждого ТекущаяСтрока Из НастройкаКонвертации.ПроизвольныеВалидации Цикл
			Если Не ТекущаяСтрока.Активна Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеВалидации = МанифестОписанияВалидации();
			ЗаполнитьЗначенияСвойств(ОписаниеВалидации, ТекущаяСтрока);
			Контекст.ПроизвольныеВалидации.Добавить(ОписаниеВалидации);
		КонецЦикла;
		
	КонецЕсли;
	
	Контекст.ЕстьКонвертация = (Контекст.ЕстьТиповаяКонвертация Или Контекст.ЕстьНастройкаКонвертации);
	
	Возврат Контекст;
	
КонецФункции

// Сценарии получения/обработки входящего черновика, для которых допустима НКД
// без ТипДокумента1С (документ без основания в учётной системе).
//
// Параметры:
//  Сценарий - ПеречислениеСсылка.КонтурЛогистика_Сценарии
//
// Возвращаемое значение:
//  Булево
//
Функция СценарийДопускаетПустойТипДокумента1С(Знач Сценарий) Экспорт
	
	Если Не ЗначениеЗаполнено(Сценарий) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Сценарий = Перечисления.КонтурЛогистика_Сценарии.ЗагрузкаЧерновика_Обработка_ОтправкаЧерновика
		Или Сценарий = Перечисления.КонтурЛогистика_Сценарии.ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного
		Или Сценарий = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновика_ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного
		Или Сценарий = Перечисления.КонтурЛогистика_Сценарии.ЗагрузкаЧерновика_ОтправкаПодписанного;
	
КонецФункции

#КонецОбласти

#Область КонвертацияСправочников

// Поддерживаемые типы справочников конфигурации 1С
//
// Параметры:
//  ТипСправочникаЛогистика	 - Строка	 - Имя справочника логистики
// 
// Возвращаемое значение:
//  Массив - Поддерживаемые типы справочников конфигурации 1С
//
Функция ПоддерживаемыеТипыСправочниковКонфигурации1С(Знач ТипДокументаЛогистика) Экспорт
	
	Возврат КонтурЛогистика_КонвертацияТиповые.ПоддерживаемыеТипыСправочниковКонфигурации1С(ТипДокументаЛогистика);
	
КонецФункции

// Контекст настройки конвертации справочников с учетом типа учетного объекта
//
// Параметры:
//  ТипСправочникаЛогистика			 - Строка	 - Имя справочника Логистики
//  ПредставлениеУчетногоДокумента	 - Строка, Тип, ДокументСсылка, Неопределено	 - Представление учетного документа. Неопределено = любой ТипДокумента1С
//  РеквизитТитула					 - Строка	- Имя конвертируемого реквизита. Требуется для поиска настройки для конвретного реквизита.
// 
// Возвращаемое значение:
//  Структура - См. КонтурЛогистика_КонвертацияСерверПовтИсп.МанифестКонтекстаНастройкиКонвертацииСправочников
//
Функция КонтекстНастройкиКонвертацииСправочника(Знач ТипСправочникаЛогистика, Знач ПредставлениеУчетногоДокумента = Неопределено, Знач РеквизитТитула = Неопределено) Экспорт
	
	// Базовое заполнение
	Контекст = МанифестКонтекстаНастройкиКонвертацииСправочников();
	Контекст.ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	Контекст.ТипСправочникаИлиДокументаУС = ПредставлениеУчетногоДокумента;
	Контекст.ТипСправочникаЛогистика = ТипСправочникаЛогистика;
	Контекст.РеквизитТитула = РеквизитТитула;
	
	// Дополнения
	Контекст.ЭтоКТ2000 = ЭтоКТ2000();
	Контекст.ЕстьРегистрДокументыФизическихЛиц = ЕстьРегистрДокументыФизическихЛиц();
	
	// Заполняем типовой частью
	КонтурЛогистика_КонвертацияТиповые.ЗаполнитьБазовыеНастройкиКонвертацииСправочника(Контекст);
	
	// Поиск настроек конвертации в справочнике
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьНастройкуКонвертации(
		Контекст.ТипСправочникаИлиДокументаУС, Контекст.ТипСправочникаЛогистика, РеквизитТитула);
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда
		
		Если НастройкаКонвертации.Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Основная Тогда
			
			// Для типовой переносим, только часть реквизитов, которые пользователь может изменить интерактивно
			СвойстваТиповойНастройки = СвойстваТиповойНастройкиКонвертацииСправчниковДоступныеДляРедактирования();
			ЗаполнитьЗначенияСвойств(Контекст, НастройкаКонвертации, СвойстваТиповойНастройки);
			
		Иначе
			
			// Перенесем настройки
			ЗаполнитьЗначенияСвойств(Контекст, НастройкаКонвертации);
			
			Контекст.ЕстьНастройкаКонвертации = Истина;
			Контекст.НастройкаКонвертации = НастройкаКонвертации;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Контекст.ЕстьКонвертация = (Контекст.ЕстьТиповаяКонвертация Или Контекст.ЕстьНастройкаКонвертации);
	
	Возврат Контекст;
	
КонецФункции

#КонецОбласти

#Область Дополнения

// Определяем это конфигурация содержит данные для продавцов алкогольной продукции (КТ-2000)
// 
// Возвращаемое значение:
//  Булево - признак наличия необходимых методанных дополнения КТ-2000
//
Функция ЭтоКТ2000() Экспорт
	
	Возврат Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользуетсяКонвертацияКТ2000");
		
КонецФункции

// Есть регистр сведений "Документы физических лиц"
// 
// Возвращаемое значение:
//  Булево - признак наличия регистра сведений
//
Функция ЕстьРегистрДокументыФизическихЛиц() Экспорт
	
	МетаданныеРСДокументыФизическихЛиц = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ДокументыФизическихЛиц");
	
	Если МетаданныеРСДокументыФизическихЛиц = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Поиск уже связанного объекта к логистическому объекту
//
// Параметры:
//  ВычисленноеЗначение			 - Строка, Ссылка	 - Объект для поиска в связях.
//  СпособКонвертацииЗначения	 - Перечисление.КонтурЛогистика_СпособыКонвертации	 - Способ конвертации объекта.
// 
// Возвращаемое значение:
//  СправочникСсылка - Объект логистики к которому привязано начение.
//
Функция СвязанныйОбъектЛогистики(Знач ВычисленноеЗначение, Знач СпособКонвертацииЗначения, Знач РеквизитПоискаНКС) Экспорт
	
	КонтурЛогистика_КонвертацияСервер.СвязанныйОбъектЛогистики(ВычисленноеЗначение, СпособКонвертацииЗначения, РеквизитПоискаНКС);
	
КонецФункции

// Список свойства типовой настройки конвертации доступные для редактирования пользователем
// 
// Возвращаемое значение:
//  Массив - список свойств
//
Функция СвойстваТиповойНастройкиКонвертацииДокументовДоступныеДляРедактирования() Экспорт
	
	СвойстваТиповойНастройки = Новый Массив;
	СвойстваТиповойНастройки.Добавить("Сценарий");
	СвойстваТиповойНастройки.Добавить("СценарийПоУмолчанию");
	СвойстваТиповойНастройки.Добавить("ОбязательноБезЗамечаний");
	СвойстваТиповойНастройки.Добавить("ПодписантТекущийПользователь");
	СвойстваТиповойНастройки.Добавить("ОбязательныйДокументУчетнойСистемыДляОтправки");
	СвойстваТиповойНастройки.Добавить("ВыводитьЗадачи");
	СвойстваТиповойНастройки.Добавить("ТолькоПроведенные");
	
	// Сценарии
	СвойстваТиповойНастройки.Добавить("Сценарий_ОтправлятьНеподписанный");
	СвойстваТиповойНастройки.Добавить("Сценарий_ОтправлятьПодписанный");
	СвойстваТиповойНастройки.Добавить("Сценарий_ОтправлятьВФоне");
	СвойстваТиповойНастройки.Добавить("Сценарий_ОтправлятьВСеансе");
	СвойстваТиповойНастройки.Добавить("Сценарий_РазрешитьПодписыватьПослеОтправки");
	СвойстваТиповойНастройки.Добавить("Сценарий_РазрешитьПодписыватьПолученныйЧерновик");
	
	// Документ учетной системы
	СвойстваТиповойНастройки.Добавить("ПоискОснованийКодНа1С");
	
	// Разделитель
	СвойстваТиповойНастройки.Добавить("Разделитель");
	СвойстваТиповойНастройки.Добавить("РазделительИмяРеквизита");
	СвойстваТиповойНастройки.Добавить("РазделительИмяТЧ");
	СвойстваТиповойНастройки.Добавить("РазделительКодНа1С");
	СвойстваТиповойНастройки.Добавить("РазделительУсловиеСтрокиТоваров");
	
	Возврат СвойстваТиповойНастройки;
	
КонецФункции

// Список свойства типовой настройки конвертации справочников доступные для редактирования пользователем
// 
// Возвращаемое значение:
//  Строка - список свойств
//
Функция СвойстваТиповойНастройкиКонвертацииСправчниковДоступныеДляРедактирования() Экспорт
	
	СвойстваТиповойНастройки = Новый Массив;
	СвойстваТиповойНастройки.Добавить("ОбновлятьРеквизитыИзУчетнойСистемы");
	СвойстваТиповойНастройки.Добавить("СоздаватьЭлементСправочникаУчетнойСистемы");
	
	Возврат КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(СвойстваТиповойНастройки, ",");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МанифестКонтекстаНастройкиКонвертацииДокументов() Экспорт
	
	Манифест = Новый Структура;
	Манифест.Вставить("ИмяКонфигурации");
	Манифест.Вставить("НастройкаКонвертации");
	Манифест.Вставить("ЕстьКонвертация", Ложь);
	Манифест.Вставить("ЕстьТиповаяКонвертация", Ложь);
	Манифест.Вставить("ЕстьНастройкаКонвертации", Ложь);
	Манифест.Вставить("ВыводитьЗадачи", Истина);
	Манифест.Вставить("Тип");
	Манифест.Вставить("ТипДокументаЛогистика");
	Манифест.Вставить("ТипДокумента1С");
	Манифест.Вставить("НаправлениеКонвертации");
	Манифест.Вставить("СценарийПоУмолчанию");
	Манифест.Вставить("Сценарий");
	Манифест.Вставить("ОбязательноБезЗамечаний", Ложь);
	Манифест.Вставить("ОбратныйМаппинг", Ложь);
	Манифест.Вставить("ПодписантТекущийПользователь", Ложь);
	Манифест.Вставить("ТолькоПроведенные", Ложь);
	Манифест.Вставить("СворачиватьТабЧастьТовары", Ложь);
	Манифест.Вставить("УсловиеГруппировкиСтрокТоваров", "");
	Манифест.Вставить("ДополнительныеИсточники", "");
	Манифест.Вставить("ДополнительныеКолонки", Новый Массив);
	Манифест.Вставить("ПроизвольныеВалидации", Новый Массив);
	
	// Документ учетной системы
	Манифест.Вставить("ПоискОснованийКодНа1С", "");
	
	// Разделитель
	Манифест.Вставить("Разделитель", Перечисления.КонтурЛогистика_ВариантыРазделителя.НеРазделять);
	Манифест.Вставить("РазделительИмяРеквизита", "");
	Манифест.Вставить("РазделительИмяТЧ", "");
	Манифест.Вставить("РазделительКодНа1С", "");
	Манифест.Вставить("РазделительУсловиеСтрокиТоваров", "");
	
	// Дополнения
	Манифест.Вставить("ЭтоКТ2000", Ложь);
	Манифест.Вставить("ЕстьРегистрДокументыФизическихЛиц", Ложь);
	
	// Валидации отправки
	Манифест.Вставить("Сценарий_ОтправлятьНеподписанный", Ложь);
	Манифест.Вставить("Сценарий_ОтправлятьПодписанный", Истина);
	Манифест.Вставить("Сценарий_ОтправлятьВФоне", Ложь);
	Манифест.Вставить("Сценарий_ОтправлятьВСеансе", Истина);
	Манифест.Вставить("Сценарий_РазрешитьПодписыватьПослеОтправки", Ложь);
	Манифест.Вставить("Сценарий_РазрешитьПодписыватьПолученныйЧерновик", Ложь);
	Манифест.Вставить("ОбязательныйДокументУчетнойСистемыДляОтправки", Ложь);
	
	Манифест.Вставить("ПутиРеквизитовУчетногоДокумента", МанифестПутиРеквизитовУчетногоДокумента());
	
	Манифест.Вставить("ДокументыОснованияВложенныхДокументов", МанифестДокументыОснованияВложенныхДокументов());
	
	Возврат Манифест;
	
КонецФункции

Функция МанифестДокументыОснованияВложенныхДокументов()
	
	Манифест = Новый Структура;
	
	Манифест.Вставить("РассчитыватьВложенныеОснования", Ложь);
	Манифест.Вставить("ПутьРеквизитДокументОснования", "");
	Манифест.Вставить("ИмяТЧДокументыОснования", "");
	Манифест.Вставить("ВыражениеВычисленияДокументОснования", "");
	
	Возврат Манифест;
	
КонецФункции	

Функция МанифестПутиРеквизитовУчетногоДокумента()
	
	Манифест = Новый Структура;
	Манифест.Вставить("ПутьОрганизация", "");
	Манифест.Вставить("ПутьКонтрагент", "");
	Манифест.Вставить("ПутьПеревозчик", "");
	
	Манифест.Вставить("ПутьГрузоотправитель", "");
	Манифест.Вставить("ПутьГрузополучатель", "");
	
	Манифест.Вставить("ПутьМестоПогрузки", "");
	Манифест.Вставить("ПутьМестоДоставки", "");
	
	Манифест.Вставить("ПутьДоп1", "");
	Манифест.Вставить("ПутьДоп2", "");
	
	Манифест.Вставить("ПутьНомерТРН", "");
	Манифест.Вставить("ПутьДатаТРН", "");
	
	Манифест.Вставить("ПутьВодитель", "");
	Манифест.Вставить("ПутьТранспортноеСредство", "");
	
	Возврат Манифест;
	
КонецФункции

Функция МанифестОписанияДоплнительнойКолонки() Экспорт
	
	Манифест = Новый Структура;
	Манифест.Вставить("НомерСтроки", 0);
	Манифест.Вставить("Заголовок", "");
	Манифест.Вставить("ПутьКДанным", "");
	Манифест.Вставить("Отбор", Ложь);
	Манифест.Вставить("Тип", "");
	Манифест.Вставить("ДобавленИзКонструктораЗапроса", Ложь);
	Манифест.Вставить("СтрокаНеограниченнойДлины", Ложь);
	
	Возврат Манифест;
	
КонецФункции

Функция МанифестОписанияВалидации()
	
	Манифест = Новый Структура;
	Манифест.Вставить("Активна", Ложь);
	Манифест.Вставить("ДействиеПриОтказеВалидации", Перечисления.КонтурЛогистика_ДействияПриОтказеВалидации.Предупреждение);
	Манифест.Вставить("ТекстВалидации", "");
	Манифест.Вставить("ТекстОшибки", "");
	
	Возврат Манифест;
	
КонецФункции

Функция МанифестКонтекстаНастройкиКонвертацииСправочников()
	
	Манифест = Новый Структура;
	Манифест.Вставить("ИмяКонфигурации");
	Манифест.Вставить("НастройкаКонвертации");
	Манифест.Вставить("ЕстьКонвертация", Ложь);
	Манифест.Вставить("ЕстьТиповаяКонвертация", Ложь);
	Манифест.Вставить("ЕстьНастройкаКонвертации", Ложь);
	Манифест.Вставить("Тип");
	Манифест.Вставить("ТипСправочникаИлиДокументаУС");
	Манифест.Вставить("ТипСправочникаЛогистика");
	Манифест.Вставить("ТипДокументаОснования");
	Манифест.Вставить("РеквизитТитула");
	Манифест.Вставить("НаправлениеКонвертации");
	Манифест.Вставить("ОбновлятьРеквизитыИзУчетнойСистемы", Ложь);
	Манифест.Вставить("СоздаватьЭлементСправочникаУчетнойСистемы", Истина);
	
	// Дополнения
	Манифест.Вставить("ЭтоКТ2000", Ложь);
	Манифест.Вставить("ЕстьРегистрДокументыФизическихЛиц", Ложь);
	
	Возврат Манифест;
	
КонецФункции

#КонецОбласти
